Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.Distance Property
 The distance from the first dimension point to the dimension line. The distance is measured in paper millimeters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace